docs/gccemacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-24 Sat 11:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Raimon Grau" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>

</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7002740">Testbed</a></li>
<li><a href="#org5968635">lap</a></li>
<li><a href="#orgbbe7dbc">limplify</a></li>
<li><a href="#orgc497b06">loop</a></li>
<li><a href="#orgfe47e4b">pure?</a></li>
<li><a href="#orgbfbbecf">bb</a></li>
<li><a href="#orge12cf52">refs</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7002740" class="outline-2">
<h2 id="org7002740">Testbed</h2>
<div class="outline-text-2" id="text-org7002740">
<p>
To try gccemacs using docker, you can use something like the
following command. The <a href="./comp-test.el">./comp-test.el</a> is just a small example of how
to native-compile a single function while maximizing the logging.
</p>

<div class="org-src-container">
<pre class="src src-bash">docker run -ti --network host -e <span style="color: #cae682;">DISPLAY</span>=$<span style="color: #cae682;">DISPLAY</span> <span style="color: #95e454;">\</span>
-v/tmp/.X11-unix:/tmp/.X11-unix -v $<span style="color: #cae682;">PWD</span>:/tmp/web <span style="color: #95e454;">\</span>
andreacorallo/emacs-nativecomp emacs /tmp/web/comp-test.el
</pre>
</div>

<p>
<a href="./comp-test.el">./comp-test.el</a>
</p>
</div>
</div>


<div id="outline-container-org5968635" class="outline-2">
<h2 id="org5968635">lap</h2>
<div class="outline-text-2" id="text-org5968635">
<p>
output of comp-lap
</p>
<div class="org-src-container">
<pre class="src src-elisp">
#s(comp-func-l
   <span style="color: #e5786d;">:name</span> foo
   <span style="color: #e5786d;">:c-name</span> <span style="color: #95e454;">"F666f6f_foo_0"</span>
   <span style="color: #e5786d;">:byte-func</span> #f(compiled-function () #&lt;bytecode 0x1f4000170cb5&gt;)
   <span style="color: #e5786d;">:doc</span> nil
   <span style="color: #e5786d;">:int-spec</span> nil
   <span style="color: #e5786d;">:lap</span> ((byte-constant 123 . 0) (byte-return . 0))
   <span style="color: #e5786d;">:ssa-status</span> nil
   <span style="color: #e5786d;">:frame-size</span> 1
   <span style="color: #e5786d;">:blocks</span> #&lt;hash-table eql 0/65 0x1e09afb&gt;
   <span style="color: #e5786d;">:lap-block</span> #&lt;hash-table equal 0/65 0x998945&gt;
   <span style="color: #e5786d;">:edges</span> nil
   <span style="color: #e5786d;">:block-cnt-gen</span> (closure ((n . -1) . #1=(cl-struct-comp-edge-tags
                                           cl-struct-comp-latch-tags
                                           cl-struct-comp-block-lap-tags
                                           cl-struct-comp-block-tags
                                           cl-struct-comp-nargs-tags
                                           cl-struct-comp-args-tags
                                           cl-struct-comp-args-base-tags
                                           cl-struct-comp-ctxt-tags
                                           cl-struct-comp-data-container-tags
                                           t)
                            ) . #2=(nil (<span style="color: #8ac6f2; font-weight: bold;">setq</span> n (1+ n))))
   <span style="color: #e5786d;">:edge-cnt-gen</span> (closure ((n . -1) . #1#) . #2#)
   <span style="color: #e5786d;">:has-non-local</span> nil
   <span style="color: #e5786d;">:array-h</span> #&lt;hash-table eql 1/65 0x9b7783&gt;
   <span style="color: #e5786d;">:speed</span> 2
   <span style="color: #e5786d;">:pure</span> nil
   <span style="color: #e5786d;">:args</span> #s(comp-args
            <span style="color: #e5786d;">:min</span> 0
            <span style="color: #e5786d;">:max</span> 0))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbe7dbc" class="outline-2">
<h2 id="orgbbe7dbc">limplify</h2>
<div class="outline-text-2" id="text-orgbbe7dbc">
<p>
(defun foo (x y) (+ x y))
comp-ctxt
</p>
<div class="org-src-container">
<pre class="src src-elisp">
(fn X Y) nil nil
((byte-stack-ref . 1) (byte-stack-ref . 1) (byte-plus . 0) (byte-return . 0))
 t 4
 #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125
 data
 (entry
 #s(comp-block-lap entry
 ((comment <span style="color: #95e454;">"Lisp function: foo"</span>)
 (set-par-to-local #s(comp-mvar 28180332 0 nil nil nil) 0)
 (set-par-to-local #s(comp-mvar 29898452 1 nil nil nil) 1)
 (jump bb_0))
 nil
 nil
 (#s(comp-edge #2 #s(comp-block-lap bb_0
 ((comment <span style="color: #95e454;">"LAP op byte-stack-ref"</span>)
 (set #s(comp-mvar 27590732 2 nil nil nil)
      #s(comp-mvar 28180332 0 nil nil nil))
 (comment <span style="color: #95e454;">"LAP op byte-stack-ref"</span>)
 (set #s(comp-mvar 13418998 3 nil nil nil)
      #s(comp-mvar 29898452 1 nil nil nil))
 (comment <span style="color: #95e454;">"LAP op byte-plus"</span>)
 (set #s(comp-mvar 28878218 2 nil nil number)
        (callref + #s(comp-mvar 27590732 2 nil nil nil)
                   #s(comp-mvar 13418998 3 nil nil nil)))
 (comment <span style="color: #95e454;">"LAP op byte-return"</span>)
 (<span style="color: #8ac6f2; font-weight: bold;">return</span> #s(comp-mvar 28878218 2 nil nil number)))
 nil
 (#4)
 nil
 nil
 #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data ())
 nil
 [#s(comp-mvar 28180332 0 nil nil nil) #s(comp-mvar 29898452 1 nil nil nil) #s(comp-mvar 28878218 2 nil nil number) #s(comp-mvar 13418998 3 nil nil nil)]
 1
 0)
 0))
 nil
 #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data ())
 nil [#s(comp-mvar 28180332 0 nil nil nil) #s(comp-mvar 29898452 1 nil nil nil) #s(comp-mvar 27954822 2 nil nil nil) #s(comp-mvar 27954836 3 nil nil nil)]
 -1 nil)
 bb_0
 #s(comp-block-lap bb_0 ((comment <span style="color: #95e454;">"LAP op byte-stack-ref"</span>) (set #s(comp-mvar 27590732 2 nil nil nil) #s(comp-mvar 28180332 0 nil nil nil)) (comment <span style="color: #95e454;">"LAP op byte-stack-ref"</span>) (set #s(comp-mvar 13418998 3 nil nil nil) #s(comp-mvar 29898452 1 nil nil nil)) (comment <span style="color: #95e454;">"LAP op byte-plus"</span>) (set #s(comp-mvar 28878218 2 nil nil number) (callref + #s(comp-mvar 27590732 2 nil nil nil) #s(comp-mvar 13418998 3 nil nil nil))) (comment <span style="color: #95e454;">"LAP op byte-return"</span>) (<span style="color: #8ac6f2; font-weight: bold;">return</span> #s(comp-mvar 28878218 2 nil nil number))) nil (#s(comp-edge #s(comp-block-lap entry ((comment <span style="color: #95e454;">"Lisp function: foo"</span>) (set-par-to-local #s(comp-mvar 28180332 0 nil nil nil) 0) (set-par-to-local #s(comp-mvar 29898452 1 nil nil nil) 1) (jump bb_0)) nil nil (#4) nil #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data ()) nil [#s(comp-mvar 28180332 0 nil nil nil) #s(comp-mvar 29898452 1 nil nil nil) #s(comp-mvar 27954822 2 nil nil nil) #s(comp-mvar 27954836 3 nil nil nil)] -1 nil) #2 0)) nil nil #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data ()) nil [#s(comp-mvar 28180332 0 nil nil nil) #s(comp-mvar 29898452 1 nil nil nil) #s(comp-mvar 28878218 2 nil nil number) #s(comp-mvar 13418998 3 nil nil nil)] 1 0)))

 #s(hash-table size 65 test equal rehash-size 1.5 rehash-threshold 0.8125 data ())
 (#s(comp-edge #s(comp-block-lap entry ((comment <span style="color: #95e454;">"Lisp function: foo"</span>) (set-par-to-local #s(comp-mvar 28180332 0 nil nil nil) 0) (set-par-to-local #s(comp-mvar 29898452 1 nil nil nil) 1) (jump bb_0)) nil nil (#2) nil #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data ()) nil [#s(comp-mvar 28180332 0 nil nil nil) #s(comp-mvar 29898452 1 nil nil nil) #s(comp-mvar 27954822 2 nil nil nil) #s(comp-mvar 27954836 3 nil nil nil)] -1 nil) #s(comp-block-lap bb_0 ((comment <span style="color: #95e454;">"LAP op byte-stack-ref"</span>) (set #s(comp-mvar 27590732 2 nil nil nil) #s(comp-mvar 28180332 0 nil nil nil)) (comment <span style="color: #95e454;">"LAP op byte-stack-ref"</span>) (set #s(comp-mvar 13418998 3 nil nil nil) #s(comp-mvar 29898452 1 nil nil nil)) (comment <span style="color: #95e454;">"LAP op byte-plus"</span>) (set #s(comp-mvar 28878218 2 nil nil number) (callref + #s(comp-mvar 27590732 2 nil nil nil) #s(comp-mvar 13418998 3 nil nil nil))) (comment <span style="color: #95e454;">"LAP op byte-return"</span>) (<span style="color: #8ac6f2; font-weight: bold;">return</span> #s(comp-mvar 28878218 2 nil nil number))) nil (#2) nil nil #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data ()) nil [#s(comp-mvar 28180332 0 nil nil nil) #s(comp-mvar 29898452 1 nil nil nil) #s(comp-mvar 28878218 2 nil nil number) #s(comp-mvar 13418998 3 nil nil nil)] 1 0) 0))
 #[0 <span style="color: #95e454;">"&#192;&#137;&#162;T&#160;&#135;"</span> [(0)] 2]
 #[0 <span style="color: #95e454;">"&#192;&#137;&#162;T&#160;&#135;"</span> [(0)] 2]
 nil
 #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (0 4))
 2
 nil
 #s(comp-args 2 2))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgc497b06" class="outline-2">
<h2 id="orgc497b06">loop</h2>
<div class="outline-text-2" id="text-orgc497b06">
<p>
(let ((i 0))
(loop i 1 to 1000000000
      do (incf i))
)
</p>
</div>
</div>

<div id="outline-container-orgfe47e4b" class="outline-2">
<h2 id="orgfe47e4b">pure?</h2>
<div class="outline-text-2" id="text-orgfe47e4b">
<p>
(defun a ()
   (b))
</p>

<p>
(defun b ()
   (c))
</p>

<p>
(defun c ()
   1)
</p>

<p>
(setq foo (myfunc 1))
(myfunc 1)
</p>
</div>
</div>

<div id="outline-container-orgbfbbecf" class="outline-2">
<h2 id="orgbfbbecf">bb</h2>
<div class="outline-text-2" id="text-orgbfbbecf">
<div class="org-src-container">
<pre class="src src-elisp">  (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682;">my-fun</span> (p1)
    (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((a 1))
      (<span style="color: #8ac6f2; font-weight: bold;">if</span> p1
          (<span style="color: #8ac6f2; font-weight: bold;">setf</span> a 2)
        (<span style="color: #8ac6f2; font-weight: bold;">setf</span> a 4))
      (print a)))

(my-fun nil)
(fmakunbound 'my-fun)

</pre>
</div>

<p>
(let ((a 1))
  (if (foo)
    (print "hi")
    (print a)))
</p>
</div>
</div>

<div id="outline-container-orge12cf52" class="outline-2">
<h2 id="orge12cf52">refs</h2>
<div class="outline-text-2" id="text-orge12cf52">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Static_single_assignment_form#Converting_to_SSA">https://en.wikipedia.org/wiki/Static_single_assignment_form#Converting_to_SSA</a></li>
<li><a href="https://www.cs.rice.edu/~keith/EMBED/dom.pdf">https://www.cs.rice.edu/~keith/EMBED/dom.pdf</a></li>
<li><a href="https://linuxplumbersconf.org/event/7/contributions/741/">https://linuxplumbersconf.org/event/7/contributions/741/</a></li>
<li><a href="https://blog.yossarian.net/2020/10/23/Understanding-static-single-assignment-forms">https://blog.yossarian.net/2020/10/23/Understanding-static-single-assignment-forms</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Raimon Grau</p>
<p class="date">Created: 2020-10-24 Sat 11:43</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
